// // --створити масив та вивести його в консоль:
// // - з 5 числових значень
// let arrNum = [14, 21, 13, 34, 55];
// console.log(arrNum);
//
// // - з 5 стічкових значень
// let arrStr = ['Hello', 'Ok10', 'School', 'World', 'OK_ten'];
// console.log(arrStr);
//
//
// // - з 5 значень стрічкового, числового та булевого типу
// let array = ['One', 'Two', 1, true, 51];
// console.log(array);
//
// // -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let arrayInput = [];
// arrayInput[1] = 10;
// arrayInput[3] = 10;
// arrayInput[5] = 10;
// console.log(arrayInput);
//
// // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let i = 0; i < 10; i++) {
//     document.write(`<div>` + 'TEXT ' + `</div>`);
// }
//
// // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i = 0; i < 10; i++) {
//     document.write(`<div>` + 'TEXT ' + (i + 1) + `</div>`);
// }
//
// // - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// for (let i = 0; i < 10; i++) {
//     document.write(`<h1>` + 'TEXT ' + (i + 1) + `</h1>`);
// }
//
// // - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// for (let i = 0; i < 10; i++) {
//     document.write(`<div>` + 'TEXT ' + (i + 1) + `</div>`);
// }
//
// // - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let arrayTenElement = [1, 2, 3, 4, 5, 65, 63, 45, 55, 65];
// for (let item of arrayTenElement) {
//     console.log(item);
// }
//
// // - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let arrayTenStr = ['hello','what?','name','father','mother','Ok10', 'Homework', 'classwork', 'title', 'description'];
// for (let item of arrayTenStr) {
//     console.log(item);
// }
//
// // - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let arrayTenAll = [true, 0,'name',4442,'mother',false, 'Homework', 12.44, 'title', 4151];
// for (let item of arrayTenAll) {
//     console.log(item);
// }
//
// // - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let arrayTenTypeOf = [true, 0,'name',4442,'mother',false, 'Homework', 12.44, 'title', 4151];
// for (let item of arrayTenTypeOf) {
//     if(typeof item == "boolean")
//     console.log(item);
// }
// //
// // - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let arrayTenTypeOf = [true, 0,'name',4442,'mother',false, 'Homework', 12.44, 'title', 4151];
// for (let item of arrayTenTypeOf) {
//     if(typeof item == "number")
//     console.log(item);
// }

// // - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let arrayTenTypeOf = [true, 0,'name',4442,'mother',false, 'Homework', 12.44, 'title', 4151];
// for (let item of arrayTenTypeOf) {
//     if(typeof item == "string")
//         console.log(item);
// }

// // - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let arrayElement10 = [];
// arrayElement10[0] = 'Hello';
// arrayElement10[1] = 1;
// arrayElement10[2] = 41;
// arrayElement10[3] = true;
// arrayElement10[4] = false;
// arrayElement10[5] = 'Good';
// arrayElement10[6] = 'Int';
// arrayElement10[7] = 'Hello';
// arrayElement10[8] = 'First';
// arrayElement10[9] = 'Name';
// for (let item of arrayElement10){
//     console.log(item);
// }

// // - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 10; i++){
//     console.log('Step: ' + i);
//     document.write(`<h5>`+ 'Step: ' + i +`</h5>`);
// }

// // - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i++){
//     console.log('Step: ' + i);
//     document.write(`<h5>`+ 'Step: ' + i +`</h5>`);
// }

// // - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i = i + 2){
//     console.log('Step: ' + i);
//     document.write(`<h5>`+ 'Step: ' + i +`</h5>`);
// }

// // - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++){
//     if (i % 2 === 0) {
//     console.log('Step: ' + i);
//     document.write(`<h5>`+ 'Step: ' + i +`</h5>`);
//     }
// }

// // - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++){
//     if (i % 2 === 1) {
//     console.log('Step: ' + i);
//     document.write(`<h5>`+ 'Step: ' + i +`</h5>`);
//     }
// }

// // - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// for (let minuts = 0; minuts < 60; minuts++) {
//     console.log(minuts);
//     if (minuts === 2){
//         break;
//     }
//     for (let seconds = 0; seconds < 60; seconds++) {
//         console.log(seconds);
//     }
// }

// // - Відтворити роботу годинника, відрахувавши  2 години  (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// for (let hour = 0; hour < 60; hour++) {
//     if (hour === 2) {
//         break;
//     }
//     for (let minuts = 0; minuts < 60; minuts++) {
//         console.log(minuts);
//         for (let seconds = 0; seconds < 60; seconds++) {
//             console.log(seconds);
//         }
//     }
// }


// // Додатково
// // - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// // - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// // - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// // - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// //
// // =================
// // =================
// // =================
// // =================
// //
// // - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// // - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// // - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// // - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// // - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// // - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// // - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// // - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// // - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
// //
// //
// // ============
// //
// // зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// //     1. перебрати його циклом while
// //     2. перебрати його циклом for
// //     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// // 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// // 5. перебрати циклом while та вивести  числа тільки парні  значення
// // 6. перебрати циклом for та вивести  числа тільки парні  значення
// // 7. замінити кожне число кратне 3 на слово "okten"
// // 8. вивести масив в зворотньому порядку.
// // 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// // 10
// // створити пустий масив та :
// //     - заповнити його 50 парними числами за допомоги циклу.
// // - заповнити його 50 непарними числами за допомоги циклу.
// //
// //
// // 1
// // створити пустий масив та :
// //     1. заповнити його 50 парними числами за допомоги циклу.
// // 2. заповнити його 50 непарними числами за допомоги циклу.
// // 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
// //     диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// // 2. вывести на консоль  каждый третий елемент
// // 3. вывести на консоль  каждый третий елемент
// // но при условии что его значение является парным.
// // 4. вывести на консоль  каждый третий елемент
// // но при условии что он имеет парное значение и
// // записать их в другой массив.
// // 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
// // 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
// //
// // 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// // 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// // додати його в інший масив.
